Процедура Тест(СвояТранзакция) Экспорт
    Если СвояТранзакция Тогда
        НачатьТранзакцию();
    КонецЕсли;
    #Если Сервер Тогда
    Попытка
        ЗаписатьДанные();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
    #Иначе
    Попытка
        ЗаписатьДанныеКлиента();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
    #КонецЕсли
КонецПроцедуры
